In [1]:
from io import StringIO

import pandas as pd
import requests

# Read the dataset
url='https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
s=requests.get(url).text

babyNames=pd.read_csv(StringIO(s))

In [2]:
babyNames.head(8)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30

In [3]:
babyNames.columns.values

array(['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype=object)

In [4]:
# 1. Delete unnamed column
del babyNames['Unnamed: 0']

In [5]:
babyNames.head(7)

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41
5  11355  Abigail  2004      F    AK     37
6  11356   Olivia  2004      F    AK     33

In [6]:
# 2. Show the distribution of male and female
babyNames['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [30]:
# 3. Show the top 5 most preferred names
babyNames['Name'].value_counts().head(5)

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

In [35]:
# 4. Median name occurence in the dataset
babyNames['Name'].value_counts().median()

8.0

In [31]:
# 5. Distribution of male and female born count by states
pd.crosstab(babyNames['Gender'],babyNames['State'])

State,AK,AL,AR,AZ,CA,CO,CT,DC,DE,FL,...,SD,TN,TX,UT,VA,VT,WA,WI,WV,WY
Gender,,,,,,,,,,,,,,,,,,,,,
F,2404,9878,7171,14518,45144,11424,6575,3053,2549,25781,...,2838,13063,39760,9515,14759,1398,13329,10549,4305,1456
M,2587,8419,6475,10820,31637,9183,5733,3000,2440,20070,...,2908,10588,27791,8233,11997,1618,11049,8940,3733,1904